/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Ungültiger Wert.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "Der Wert „%@“ ist ungültig.";

/* NSFormattingError */
"Err2048-C" = "Formatierungsfehler.";

/* NSFileLockingError */
"Err255-C" = "Die Datei konnte nicht geschützt werden.";

/* NSFileLockingError */
"Err255-R" = "Möglicherweise ist die Datei bereits geschützt oder Sie haben nicht die notwendigen Zugriffsrechte, um sie zu schützen.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Die Datei „%@“ konnte nicht geschützt werden.";

/* NSFileReadUnknownError */
"Err256" = "Die Datei konnte nicht geöffnet werden.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Die Datei „%@“ konnte nicht geöffnet werden.";

/* NSFileReadNoPermissionError */
"Err257" = "Die Datei konnte nicht geöffnet werden, da Sie nicht über die notwendigen Zugriffsrechte verfügen.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Sie haben nicht die notwendigen Zugriffsrechte.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Um die Zugriffsrechte anzuzeigen oder zu ändern, wählen Sie das Objekt im Finder aus und wählen Sie „Ablage“  > „Informationen“.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Die Datei „%@“ konnte nicht geöffnet werden, da Sie nicht über die notwendigen Zugriffsrechte verfügen.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Ungültiger Dateiname.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Die Datei konnte nicht geöffnet werden, da der Dateiname „%@“ ungültig ist.";

/* NSFileReadCorruptFileError */
"Err259" = "Die Datei konnte nicht geöffnet werden, da sie kein gültiges Format hat.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Die Datei hat nicht das richtige Format.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Die Datei ist möglicherweise beschädigt, abgeschnitten oder in einem anderen Format, als Sie erwarteten.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Die Datei „%@“ konnte nicht geöffnet werden, da sie kein gültiges Format hat.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Die Datei existiert nicht.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Die Datei „%@“ existiert nicht.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Die Datei konnte nicht mithilfe der angegebenen Textcodierung geöffnet werden.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Die angegebene Textcodierung kann nicht angewendet werden.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Die Textcodierung „%@“ kann nicht angewendet werden.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Die Datei wurde möglicherweise mit einer anderen Textcodierung gesichert oder es handelt sich nicht um eine Textdatei.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Die Datei konnte nicht mithilfe der Textcodierung „%@“ geöffnet werden.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Die Datei „%2$@“ konnte nicht mithilfe der Textcodierung „%1$@“ geöffnet werden.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Die Datei konnte nicht geöffnet werden, da der angegebene URL-Typ nicht unterstützt wird.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Der angegebene URL-Typ wird nicht unterstützt.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Die Datei „%1$@“ konnte nicht geöffnet werden, da der URL-Typ „%2$@“ nicht unterstützt wird.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Die Datei konnte nicht geöffnet werden, da der URL-Typ „%@“ nicht unterstützt wird.";

/* NSFileReadTooLargeError */
"Err263" = "Die Datei konnte nicht geöffnet werden, da sie zu groß ist.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Die Datei ist zu groß.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Die Datei „%@“ konnte nicht geöffnet werden, da sie zu groß ist.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Die Datei konnte nicht geöffnet werden, da die Text-Codierung des Inhalts nicht bestimmt werden konnte.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Die Text-Codierung des Inhalts konnte nicht bestimmt werden.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Möglicherweise kann die Datei geöffnet werden, wenn eine Text-Codierung festgelegt wird.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Die Datei „%@“ konnte nicht geöffnet werden, da die Text-Codierung des Inhalts nicht bestimmt werden konnte.";

/* NSUserCancelledError */
"Err3072-C" = "Der Vorgang wurde abgebrochen.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "„%@“ konnte nicht entfernt werden.";

/* NSFileNoSuchFileError */
"Err4-C" = "Die Datei existiert nicht.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Die Datei „%@“ existiert nicht.";

/* NSFileWriteUnknownError */
"Err512" = "Die Datei konnte nicht gesichert werden.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "„%1$@“ konnte nicht nach „%2$@“ kopiert werden.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "„%1$@“ konnte nicht mit „%2$@“ verknüpft werden.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "„%1$@“ konnte nicht nach „%2$@“ bewegt werden.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "„%@“ konnte nicht entfernt werden.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Die Datei „%2$@“ konnte nicht im Ordner „%1$@“ gesichert werden.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Die Datei „%@“ konnte nicht gesichert werden.";

/* NSFileWriteNoPermissionError */
"Err513" = "Die Datei konnte nicht gesichert werden, da Sie nicht über die notwendigen Zugriffsrechte verfügen.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "„%1$@“ konnte nicht geöffnet werden, da Sie nicht über die notwendigen Zugriffsrechte für „%2$@“ verfügen.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "„%1$@“ konnte nicht verknüpft werden, da Sie nicht über die notwendigen Zugriffsrechte für „%2$@“ verfügen.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "„%1$@“ konnte nicht entfernt werden, da Sie nicht über die notwendigen Zugriffsrechte für „%2$@“ verfügen.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "„%@“ konnte nicht entfernt werden, da Sie nicht über die notwendigen Zugriffsrechte verfügen.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Sie haben nicht die notwendigen Zugriffsrechte.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Um die Zugriffsrechte anzuzeigen oder zu ändern, wählen Sie das Objekt im Finder aus und wählen Sie „Ablage“  > „Informationen“.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Sie haben nicht die notwendigen Zugriffsrechte, um die Datei „%2$@“ im Ordner „%1$@“ zu sichern.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Sie haben nicht die notwendigen Zugriffsrechte, um die Datei „%@“ zu sichern.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Das Objekt konnte nicht gesichert werden, da der Dateiname ungültig ist.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Das Objekt konnte nicht entfernt werden, da der Dateiname „%@“ ungültig ist.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Ungültiger Dateiname.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Das Objekt konnte nicht gesichert werden, da der Dateiname „%@“ ungültig ist.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Die Datei konnte nicht mithilfe der angegebenen Textcodierung gesichert werden.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Die angegebene Textcodierung kann nicht angewendet werden.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Die Textcodierung „%@“ kann nicht angewendet werden.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Falls möglich, wählen Sie bitte eine andere Textcodierung.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Die Datei konnte nicht mithilfe der Textcodierung „%@“ gesichert werden.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Die Datei „%2$@“ konnte nicht mithilfe der Text-Codierung „%1$@“ gesichert werden.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Die Datei konnte nicht gesichert werden, da der angegebene URL-Typ nicht unterstützt wird.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Der angegebene URL-Typ wird nicht unterstützt.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Die Datei „%1$@“ konnte nicht gesichert werden, da der URL-Typ „%2$@“ nicht unterstützt wird.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Die Datei konnte nicht gesichert werden, da der URL-Typ „%@“ nicht unterstützt wird.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Die Datei konnte nicht gesichert werden, da nicht genügend Speicher zur Verfügung steht.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "„%1$@“ konnte nicht nach „%2$@“ kopiert werden, da nicht genügend Speicher verfügbar ist.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "„%1$@“ konnte nicht mit „%2$@“ verknüpft werden, da nicht genügend Speicher verfügbar ist.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "„%1$@“ konnte nicht nach „%2$@“ bewegt werden, da nicht genügend Speicher verfügbar ist.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Es ist nicht genügend Speicher verfügbar.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Das Volume „%@“ ist voll.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Entfernen Sie einige Dateien von dem Volume und versuchen Sie es erneut.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Die Datei „%@“ kann nicht gesichert werden, da nicht genügend Speicher zur Verfügung steht.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Sie können die Datei „%1$@“ nicht sichern, da das Volume „%2$@“ voll ist.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Der Vorgang konnte nicht abgeschlossen werden. (%1$@-Fehler %2$ld.)";

